Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: In interactive mode, if the value is not ``None``, it is converted to a string using the built-in :func:`repr` function and the resulting string is written to standard output on a line by itself (except if the result is ``None``, so that procedure calls do not cause any output.)
ru: В интерактивном режиме, если его результат не «:const:`None`» , то результат преобразуется в строку встроенной функцией «:func:`repr`» , и эта строка выдаётся на стандартный вывод (а если результат «:const:`None`» , то ничего не выводится) .

source: Assignment statements are used to (re)bind names to values and to modify attributes or items of mutable objects:
ru: Инструкции назначения используются для (пере)связывания имён со значениями и для изменения атрибутов или элементов изменяемых объектов :

source: (See section :ref:`primaries` for the syntax definitions for the last three symbols.)
ru: (Смотри определения синтаксиса последних трёх обозначений в разделе «:ref:`primaries`» . )

source: An assignment statement evaluates the expression list (remember that this can be a single expression or a comma-separated list, the latter yielding a tuple) and assigns the single resulting object to each of the target lists, from left to right.
ru: Инструкция назначения последовательно назначает объект, получившийся в результате вычисления очередного выражения из списка выражений (учитывая, что этот список может содержать одно выражение или список, разделённый запятыми) - соответственно очередной цели из списка целей, в обоих списках - слева направо.

source: Assignment is defined recursively depending on the form of the target (list). When a target is part of a mutable object (an attribute reference, subscription or slicing), the mutable object must ultimately perform the assignment and decide about its validity, and may raise an exception if the assignment is unacceptable. The rules observed by various types and the exceptions raised are given with the definition of the object types (see section :ref:`types`).
ru: Назначение определяется рекурсивно – в зависимости от структуры цели назначения (например список) . Если цель является частью изменяемого объекта (атрибут, элемент по индексу) , то сам этот изменяемый объект должен в итоге выполнить назначение и решить допустимо ли оно и, если нужно, может инициировать исключение. Правила, которых придерживаются различные типы, и инициируемые ими исключения – определены в самих этих типах (смотрите раздел «Иерархия стандартных типов» :ref:`types` ) .

source: Assignment of an object to a target list, optionally enclosed in parentheses or square brackets, is recursively defined as follows.
ru: Назначение объекта списку целей, который может быть заключён в круглые или квадратные скобки, рекурсивно определяется следующим образом.

source: If the target list is a single target: The object is assigned to that target.
ru: Если этот список целей фактически состоит из единственной цели, то данный объект назначается этой цели.

source: If the target list is a comma-separated list of targets: The object must be an iterable with the same number of items as there are targets in the target list, and the items are assigned, from left to right, to the corresponding targets. (This rule is relaxed as of Python 1.5; in earlier versions, the object had to be a tuple. Since strings are sequences, an assignment like ``a, b = "xy"`` is now legal as long as the string has the right length.)
ru: Если этот список целей является перечнем целей, разделённых запятыми, то данный объект (источник) должен быть итерируемым и иметь столько же элементов (сколько целей в списке целей), и эти элементы назначаются соответствующим по счёту (слева направо) целям. (Это правило стало менее ограниченным с версии Питона 1.5 (до этого объект источник обязан был быть кортежем) . Теперь, поскольку текстовые данные являются последовательностями, назначение вроде «``a, b = "xy"``» является допустимым, при условии, что текст имеет строго соответствующую длину.)

source: If the target list contains one target prefixed with an asterisk, called a "starred" target: The object must be a sequence with at least as many items as there are targets in the target list, minus one. The first items of the sequence are assigned, from left to right, to the targets before the starred target. The final items of the sequence are assigned to the targets after the starred target. A list of the remaining items in the sequence is then assigned to the starred target (the list can be empty).
ru: Если в перечне целей присутствует цель, перед которой стоит одна звёздочка, то объект-источник должен быть последовательностью, у которой количество элементов больше или равно количеству целей минус один. Всем целям до цели со звёздочкой назначаются соответствующие по счёту элементы источника. Всем целям после цели со звёздочкой назначаются соответствующие по счёту с конца элементы источника. Перечень оставшихся элементов в последовательности-источнике назначается цели со звёздочкой (этот перечень может быть пустым) .

source: Else: The object must be a sequence with the same number of items as there are targets in the target list, and the items are assigned, from left to right, to the corresponding targets.
ru: Иначе этот объект-источник должен быть последовательностью, у которой количество элементов равно количеству целей, и эти элементы назначаются соответствующим по счёту (слева направо) целям.

source: Assignment of an object to a single target is recursively defined as follows.
ru: Назначение объекта единственной цели определяется рекурсивно следующим образом.

source: If the target is an identifier (name):
ru: Если эта цель является идентификатором (именем) :

source: If the name does not occur in a :keyword:`global` or :keyword:`nonlocal` statement in the current code block: the name is bound to the object in the current local namespace.
ru: Если это имя не упоминается в текущем блоке кода в инструкциях «:keyword:`global`» или «:keyword:`nonlocal`» , то это имя связывается с данным объектом в текущей области имён (тоесть, создаётся локальная переменная с этим именем) .

source: Otherwise: the name is bound to the object in the global namespace or the outer namespace determined by :keyword:`nonlocal`, respectively.
ru: Иначе это имя связывается с данным объектом соответственно в глобальной области имён или во внешней области имён, определённой «:keyword:`nonlocal`» .

source: The name is rebound if it was already bound. This may cause the reference count for the object previously bound to the name to reach zero, causing the object to be deallocated and its destructor (if it has one) to be called.
ru: Данное имя переназначается, если оно уже было назначено. Это может привести к тому, что счётчик ссылок на тот объект, который был связан с данным именем, достигнет ноля, из-за чего у объекта будет вызван деструктор (если имеется) – и объект будет удалён.

source: If the target is a target list enclosed in parentheses or in square brackets: The object must be an iterable with the same number of items as there are targets in the target list, and its items are assigned, from left to right, to the corresponding targets.
ru: Если эта цель является перечнем целей, заключённым в круглые или квадратные скобки, то данный объект (источник) должен быть итерируемым и с тем же количеством элементов (как в перечне целей) , и эти элементы назначаются соответствующим по счёту (слева направо) целям.

source: If the target is an attribute reference: The primary expression in the reference is evaluated. It should yield an object with assignable attributes; if this is not the case, :exc:`TypeError` is raised. That object is then asked to assign the assigned object to the given attribute; if it cannot perform the assignment, it raises an exception (usually but not necessarily :exc:`AttributeError`).
ru: Если эта цель является указанием (ссылкой) на атрибут, то первичное выражение этой ссылки интерпретируется, что в результате должно дать объект с атрибутами, допускающими назначение – иначе инициируется «:exc:`TypeError`» . Этому полученному объекту предлагается назначить объект-источник соответствующему (своему) атрибуту – если он не может выполнить это назначение, то инициирует исключение (обычно, но не обязательно – «:exc:`AttributeError`» ) .

source: Note: If the object is a class instance and the attribute reference occurs on both sides of the assignment operator, the RHS expression, ``a.x`` can access either an instance attribute or (if no instance attribute exists) a class attribute. The LHS target ``a.x`` is always set as an instance attribute, creating it if necessary. Thus, the two occurrences of ``a.x`` do not necessarily refer to the same attribute: if the RHS expression refers to a class attribute, the LHS creates a new instance attribute as the target of the assignment::
ru: Замечание. Если объект является экземпляром класса и данная ссылка на атрибут встречается с обеих сторон оператора назначения, то правое выражение может обращаться как к атрибуту экземпляра так и (если того нет) к атрибуту класса. А цель в левой части всегда подразумевает атрибут экземпляра – и если его не было, то он создаётся. Таким образом два одинаковых упоминания атрибута не обязательно обращаются к одному и тому же атрибуту : когда выражение в правой части обращается к атрибуту класса – то в левой создаётся новый атрибут экземпляра в качестве цели назначения : ::

source: This description does not necessarily apply to descriptor attributes, such as properties created with :func:`property`.
ru: Это не обязательно относится к атрибутам-дескрипторам, например, созданным с помощью «:func:`property`» .

source: If the target is a subscription: The primary expression in the reference is evaluated. It should yield either a mutable sequence object (such as a list) or a mapping object (such as a dictionary). Next, the subscript expression is evaluated.
ru: Если цель является взятием (указанием) по индексу, то первичное выражение в этом указателе вычисляется. Оно должно давать или объект - изменяемую последовательность (например список) , или объект-отображение (например словарь) . Затем вычисляется выражение, определяющее индекс.

source: If the primary is a mutable sequence object (such as a list), the subscript must yield an integer. If it is negative, the sequence's length is added to it. The resulting value must be a nonnegative integer less than the sequence's length, and the sequence is asked to assign the assigned object to its item with that index. If the index is out of range, :exc:`IndexError` is raised (assignment to a subscripted sequence cannot add new items to a list).
ru: Если первичное выражение является изменяемой последовательностью (например списком) , то выражение, определяющее индекс, должно давать в результате целое число. Если это число отрицательное, то к нему прибавляется длина данной последовательности. Получившееся в результате значение должно быть неотрицательным целым, меньшим, чем длина данной последовательности. Затем к данной последовательности следует запрос назначить объект-источник элементу с данным значением индекса. Если индекс выходит за границы, то вызывается исключение «:exc:`IndexError`» (назначение последовательности по индексу не может добавлять новый элемент к списку) .

source: If the primary is a mapping object (such as a dictionary), the subscript must have a type compatible with the mapping's key type, and the mapping is then asked to create a key/datum pair which maps the subscript to the assigned object. This can either replace an existing key/value pair with the same key value, or insert a new key/value pair (if no key with the same value existed).
ru: Если первичное выражение является объектом-отображением (например словарём) , то индекс должен иметь тип совместимый с типом ключей данного отображения, и данному отображению делается запрос создать пару ключ/данные, которая будет ставить в соответствие исходный индекс объекту-источнику. При этом может произойти как замещение уже существовавшей пары ключ/данные новой парой с тем же значением ключа, так и добавление новой пары ключ/данные (если не было ключа с таким значением) .

source: For user-defined objects, the :meth:`__setitem__` method is called with appropriate arguments.
ru: Для объектов, определённых пользователем, вызывается метод «:meth:`__setitem__`» с соответствующими аргументами.

source: If the target is a slicing: The primary expression in the reference is evaluated. It should yield a mutable sequence object (such as a list). The assigned object should be a sequence object of the same type. Next, the lower and upper bound expressions are evaluated, insofar they are present; defaults are zero and the sequence's length. The bounds should evaluate to integers. If either bound is negative, the sequence's length is added to it. The resulting bounds are clipped to lie between zero and the sequence's length, inclusive. Finally, the sequence object is asked to replace the slice with the items of the assigned sequence. The length of the slice may be different from the length of the assigned sequence, thus changing the length of the target sequence, if the object allows it.
ru: Если цель является срезом, то первичное выражение в этом указателе вычисляется. Оно должно давать в результате объект - изменяемую последовательность (например список) . Объект-источник должен быть объектом-последовательностью того же типа. Затем вычисляются выражения, определяющие нижнюю и верхнюю границы (если таковые присутствуют) , которые по умолчанию равны нолю и длине последовательности соответственно. Эти границы должны иметь целое значение. Если какая-либо из них отрицательна, к ней прибавляется длина последовательности. Получившиеся в результате границы обрезаются так, чтобы они входили в диапазон с ноля по длину последовательности. И, наконец, данному объекту-последовательности делается запрос заменить элементы попадающие в срез на элементы последовательности источника. Длина среза может отличаться от длины источника, если объект-цель это позволяет – в этом случае длина последовательности-цели изменится.

source: In the current implementation, the syntax for targets is taken to be the same as for expressions, and invalid syntax is rejected during the code generation phase, causing less detailed error messages.
ru: В текущей реализации синтаксис для целей взят точно таким же, как и для выражений, и ошибочный синтаксис не принимается в фазе генерации кода, приводя к менее детальным сообщениям об ошибках.

source: WARNING: Although the definition of assignment implies that overlaps between the left-hand side and the right-hand side are 'safe' (for example ``a, b = b, a`` swaps two variables), overlaps *within* the collection of assigned-to variables are not safe! For instance, the following program prints ``[0, 2]``::
ru: Осторожно ! Хотя определение операции назначения подразумевает, что упоминание одного и того же объекта и в левой и в правой частях (“перекрытие”) является “безопасным” (например, «``a, b = b, a``» обменивает значения двух переменных) , “перекрытие” внутри перечисления переменных - целей назначения – не является “безопасным” ! Например, следующая программа печатает «``[0, 2]``» : ::

source: The specification for the ``*target`` feature.
ru: Спецификация для «``*target``» .

source: Augmented assignment statements
ru: Расширенные инструкции назначения

source: Augmented assignment is the combination, in a single statement, of a binary operation and an assignment statement:
ru: Расширенное назначение объединяет в одной инструкции операцию над двумя операндами (т.н. “бинарную”) и инструкцию назначения :

source: An augmented assignment evaluates the target (which, unlike normal assignment statements, cannot be an unpacking) and the expression list, performs the binary operation specific to the type of assignment on the two operands, and assigns the result to the original target. The target is only evaluated once.
ru: Расширенное назначение сначала определяет значение цели назначения (которая, в отличие от случая обычной операции назначения, не может быть распаковкой) и списка выражений, затем выполняет соответствующее двухоперандное действие, и затем этот результат назначает цели назначения. Начальное значение цели назначения вычисляется только один раз.

source: An augmented assignment expression like ``x += 1`` can be rewritten as ``x = x + 1`` to achieve a similar, but not exactly equal effect. In the augmented version, ``x`` is only evaluated once. Also, when possible, the actual operation is performed *in-place*, meaning that rather than creating a new object and assigning that to the target, the old object is modified instead.
ru: Выражение расширенного назначения вроде «``x += 1``» можно переписать как «``x = x + 1``» , что даёт подобный, но не точно тот же эффект. В “расширенной” версии – «``x``» вычисляется только один раз. Также, когда это возможно, операция выполняется “*на месте*”, тоесть, вместо создания нового объекта и потом назначения его цели – сразу используется “старый” объект.

source: With the exception of assigning to tuples and multiple targets in a single statement, the assignment done by augmented assignment statements is handled the same way as normal assignments. Similarly, with the exception of the possible *in-place* behavior, the binary operation performed by augmented assignment is the same as the normal binary operations.
ru: С учётом указанных выше оговорок (о кортежах и множественных целях) – назначения у расширенных назначений обрабатываются так же, как и обычные. Также и (за исключением исполнения “*на месте*” ) двухоперандная операция у расширенных назначений обрабатывается так же, как и обычная.

source: For targets which are attribute references, the same :ref:`caveat about class and instance attributes <attr-target-note>` applies as for regular assignments.
ru: К целям, являющимся ссылками на атрибуты, относится то же самое :ref:`предостережение о атрибутах классов и экземпляров<attr-target-note>`, как и для обычных назначений.

source: The :keyword:`assert` statement
ru: Инструкция «:keyword:`assert`»

source: Assert statements are a convenient way to insert debugging assertions into a program:
ru: Инструкция «:keyword:`assert`» (“подтверждение”) – это удобный способ вставить в программу контроль (промежуточных результатов) для наладочных целей.

source: The simple form, ``assert expression``, is equivalent to ::
ru: Для короткой формы – «``assert expression``» – эквивалентом является : ::

source: The extended form, ``assert expression1, expression2``, is equivalent to ::
ru: А для расширенной формы – «``assert expression1, expression2``» – эквивалентом является : ::

source: These equivalences assume that :const:`__debug__` and :exc:`AssertionError` refer to the built-in variables with those names. In the current implementation, the built-in variable :const:`__debug__` is ``True`` under normal circumstances, ``False`` when optimization is requested (command line option -O). The current code generator emits no code for an assert statement when optimization is requested at compile time. Note that it is unnecessary to include the source code for the expression that failed in the error message; it will be displayed as part of the stack trace.
ru: Эти эквиваленты полагаются на встроенные переменные «:const:`__debug__`» и «:exc:`AssertionError`» . В текущей реализации Питона встроенная переменная «:const:`__debug__`» – по умолчанию имеет значение «:const:`True`» , а «:const:`False`» – в случае оптимизации командой «``-O``» . Нынешний генератор кода не генерирует никакого кода для инструкций «:keyword:`assert`» , когда запрошена компиляция с оптимизацией. Заметьте, что необязательно вставлять исходный код выражения, вызвавшего ошибку, в сообщение об ошибке – оно и так будет показано, как часть стека .

source: Assignments to :const:`__debug__` are illegal. The value for the built-in variable is determined when the interpreter starts.
ru: Запись в переменную «:const:`__debug__`» – недопустима. Значение для этой встроенной переменной определяется при запуске интерпретатора.

source: The :keyword:`pass` statement
ru: Инструкция «:keyword:`pass`»

source: :keyword:`pass` is a null operation --- when it is executed, nothing happens. It is useful as a placeholder when a statement is required syntactically, but no code needs to be executed, for example::
ru: «:keyword:`pass`» – это “пустой” оператор – при его исполнении ничего не происходит. Он полезен как заместитель, когда какое либо выражение необходимо по синтаксису, но там не нужно исполнять никакого кода. Например : ::

source: The :keyword:`del` statement
ru: Инструкция «:keyword:`del`»

source: Deletion is recursively defined very similar to the way assignment is defined. Rather that spelling it out in full details, here are some hints.
ru: Удаление определяется рекурсивно – очень похоже на то, как определяется назначение. Вместо расписывания деталей грамматики – далее даны только некоторые подсказки.

source: Deletion of a target list recursively deletes each target, from left to right.
ru: Удаление списка целей – рекурсивно удаляет каждую цель слева направо.

source: Deletion of a name removes the binding of that name from the local or global namespace, depending on whether the name occurs in a :keyword:`global` statement in the same code block. If the name is unbound, a :exc:`NameError` exception will be raised.
ru: Удаление имени удаляет назначение этому имени из локальной или глобальной области имён, в зависимости от того, объявлено ли это имя в инструкции «:keyword:`global`» в этом же самом блоке. Если данное имя не было назначенным (т.е. не было определено) , то инициируется исключение «:exc:`NameError`» .

source: It is illegal to delete a name from the local namespace if it occurs as a free variable in a nested block.
ru: Недопустимо удаление имени из локальной области имён, если оно встречается в качестве “свободной” переменной во вложенном блоке.

source: Deletion of attribute references, subscriptions and slicings is passed to the primary object involved; deletion of a slicing is in general equivalent to assignment of an empty slice of the right type (but even this is determined by the sliced object).
ru: Удаление ссылок на атрибуты, а также элементов по индексу и срезов – передаётся (перепоручается) содержащему их объекту. Удаление среза – в целом эквивалентно назначению пустого среза подходящего типа (но даже это определяется (контролируется) объектом, подвергающимся срезу) .

source: The :keyword:`return` statement
ru: Инструкция «:keyword:`return`»

source: :keyword:`return` may only occur syntactically nested in a function definition, not within a nested class definition.
ru: «:keyword:`return`» может встречаться только синтаксически непосредственно внутри определения функции, но не внутри вложенных определений классов.

source: If an expression list is present, it is evaluated, else ``None`` is substituted.
ru: Если (в качестве параметров) дан список выражений, то он вычисляется – иначе подразумевается «:const:`None`» .

source: :keyword:`return` leaves the current function call with the expression list (or ``None``) as return value.
ru: «:keyword:`return`» делает выход из текущего вызова функции с указанным списком выражений (или «:const:`None`» ) в качестве возвращаемого этой функцией значения.

source: When :keyword:`return` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`finally` clause is executed before really leaving the function.
ru: Когда «:keyword:`return`» передаёт управление изнутри инструкции «:keyword:`try`» имеющей ветвь «:keyword:`finally`» , ветвь «:keyword:`finally`» исполняется до фактического выхода из этой функции.
